tests/performance/load-test.yml
config:
  target: "https://jsonplaceholder.typicode.com" # Target API
  phases:
    - duration: 10
      arrivalRate: 1
      name: "Warm up"
    - duration: 20
      arrivalRate: 2
      rampTo: 5
      name: "Ramp up load"
    - duration: 30
      arrivalRate: 5
      name: "Sustained load"

scenarios:
  - name: "Get Users"